samples/expression_bdd_dot/underscore_vars.dot
digraph bdd {
  rankdir=TB;
  "node000" [label = "var_1", name = "node000", shape = "circle", style = "filled"];
  "node001" [label = "var_2", name = "node001", shape = "circle", style = "filled"];
  "node002" [label = "var_3", name = "node002", shape = "circle", style = "filled"];
  "node003" [label = "0", fillcolor = "lightgray", name = "node003", shape = "box", style = "filled"];
  "node004" [label = "1", fillcolor = "lightgray", name = "node004", shape = "box", style = "filled"];
  "node000" -> "node001" [style = "solid"];
  "node000" -> "node002" [style = "dashed"];
  "node001" -> "node002" [style = "dashed"];
  "node001" -> "node004" [style = "solid"];
  "node002" -> "node003" [style = "dashed"];
  "node002" -> "node004" [style = "solid"];
}
